
package com.yuxiang.common.enums;

import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * 功能说明: 正则表达式枚举类
 * 开发人员: kjp
 * 开发时间: 2018/7/27 9:19 <br>
 * 功能描述: 写明作用，调用方式，使用场景，以及特殊情况<br>
 */
@Getter
@AllArgsConstructor
public enum RegexEnum {

  // 网签系统
  PASSWORD("^[A-Za-z0-9]{8,16}$", "登录密码"),
  PAY_PASSWORD("^[A-Za-z0-9]{4,10}$", "交易密码"),
  LOGIN_NAME("^[A-Za-z0-9]{8,16}$", "登录用户名"),

  // 通用规则
  INTEGER("\\d*", "整数"),
  DECIMAL("^([0-9]\\d*\\.?\\d*)|(0\\.\\d*[1-9])?$","整数或小数"),
  NUMBER("^[0-9]*.[0-9]*$", "数字"),
  TEL_PHONE("^[1-9]{1}[0-9]{5,8}$", "电话号码"),
  BANK_CARD("^[1-9]{1}[0-9]{7,22}$", "银行卡号"),
  REAL_NAME("^([\\u4e00-\\u9fa5]){2,4}$", "真实姓名"),
  EMAIL("\\w+([-+.]\\w+)*@\\w+([-.]\\w+)*\\.\\w+([-.]\\w+)*", "邮箱"),
  TEL_PHONE_AREA("^[0][1-9]{2,3}-[1-9]{1}[0-9]{5,8}$", "电话号码-带区号"),
  MOBILE_PHONE("^((13[0-9])|(14[5,7,9])|(15([0-9]))|(16[6,7,8,9])|(17[0,1,3,5,6,7,8])|(18[0-9])|(19[8|9]))[0-9]{8}$", "手机号码"),
  CARD_ID("(^[1-9]\\d{5}(18|19|([23]\\d))\\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\\d{3}[0-9Xx]$)|(^[1-9]\\d{5}\\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\\d{2}$)", "身份证"),
  CRON("", "cron定时任务表达式"),
  ;

  private String exp;

  private String desc;

}
